current_design andGate
set_input_delay  0.2 [all_inputs]
set_output_delay 0.2 [all_outputs]