###############################################################################
# Created by write_sdc
###############################################################################
current_design memory_mapped_fifo
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 20.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_en}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[0]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[10]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[11]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[12]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[13]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[14]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[15]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[16]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[17]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[18]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[19]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[1]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[20]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[21]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[22]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[23]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[24]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[25]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[26]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[27]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[28]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[29]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[2]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[30]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[31]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[3]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[4]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[5]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[6]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[7]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[8]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_data[9]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wr_en}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[0]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[1]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[2]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[3]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_valid}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[0]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[10]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[11]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[12]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[13]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[14]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[15]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[16]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[17]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[18]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[19]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[1]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[20]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[21]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[22]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[23]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[24]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[25]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[26]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[27]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[28]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[29]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[2]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[30]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[31]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[3]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[4]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[5]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[6]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[7]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[8]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[9]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_write}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst_n}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_empty}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_full}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[10]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[11]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[12]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[13]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[14]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[15]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[16]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[17]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[18]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[19]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[20]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[21]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[22]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[23]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[24]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[25]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[26]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[27]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[28]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[29]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[30]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[31]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[5]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[6]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[7]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[8]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rd_data[9]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[10]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[11]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[12]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[13]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[14]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[15]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[16]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[17]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[18]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[19]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[20]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[21]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[22]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[23]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[24]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[25]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[26]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[27]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[28]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[29]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[30]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[31]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[5]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[6]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[7]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[8]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[9]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_ready}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
