###############################################################################
# Created by write_sdc
###############################################################################
current_design andGate
###############################################################################
# Timing Constraints
###############################################################################
set_input_delay 0.2000 -add_delay [get_ports {a}]
set_input_delay 0.2000 -add_delay [get_ports {b}]
set_output_delay 0.2000 -add_delay [get_ports {c}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
