###############################################################################
# Created by write_sdc
###############################################################################
current_design bist_controller
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {bist_start}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[0]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[10]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[11]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[12]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[13]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[14]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[15]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[16]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[17]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[18]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[19]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[1]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[20]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[21]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[22]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[23]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[24]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[25]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[26]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[27]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[28]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[29]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[2]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[30]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[31]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[3]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[4]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[5]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[6]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[7]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[8]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[9]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst_n}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {bist_done}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {bist_pass}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_addr[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_addr[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_addr[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_addr[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_addr[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[10]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[11]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[12]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[13]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[14]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[15]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[16]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[17]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[18]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[19]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[20]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[21]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[22]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[23]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[24]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[25]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[26]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[27]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[28]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[29]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[30]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[31]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[5]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[6]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[7]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[8]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {error_count[9]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_enable}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[10]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[11]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[12]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[13]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[14]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[15]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[16]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[17]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[18]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[19]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[20]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[21]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[22]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[23]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[24]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[25]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[26]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[27]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[28]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[29]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[30]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[31]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[5]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[6]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[7]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[8]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[9]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_write}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
