###############################################################################
# Created by write_sdc
###############################################################################
current_design performance_counter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {clear}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[0]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[1]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[2]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[3]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[4]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[5]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[6]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {counter_sel[7]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {enable}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[0]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[1]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[2]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[3]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[4]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[5]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[6]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {event_inc[7]}]
set_input_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst_n}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[100]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[101]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[102]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[103]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[104]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[105]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[106]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[107]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[108]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[109]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[10]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[110]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[111]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[112]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[113]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[114]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[115]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[116]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[117]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[118]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[119]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[11]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[120]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[121]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[122]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[123]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[124]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[125]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[126]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[127]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[128]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[129]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[12]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[130]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[131]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[132]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[133]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[134]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[135]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[136]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[137]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[138]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[139]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[13]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[140]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[141]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[142]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[143]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[144]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[145]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[146]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[147]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[148]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[149]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[14]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[150]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[151]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[152]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[153]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[154]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[155]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[156]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[157]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[158]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[159]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[15]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[160]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[161]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[162]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[163]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[164]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[165]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[166]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[167]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[168]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[169]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[16]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[170]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[171]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[172]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[173]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[174]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[175]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[176]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[177]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[178]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[179]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[17]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[180]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[181]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[182]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[183]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[184]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[185]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[186]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[187]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[188]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[189]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[18]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[190]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[191]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[192]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[193]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[194]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[195]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[196]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[197]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[198]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[199]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[19]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[200]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[201]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[202]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[203]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[204]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[205]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[206]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[207]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[208]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[209]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[20]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[210]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[211]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[212]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[213]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[214]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[215]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[216]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[217]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[218]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[219]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[21]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[220]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[221]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[222]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[223]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[224]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[225]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[226]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[227]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[228]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[229]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[22]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[230]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[231]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[232]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[233]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[234]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[235]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[236]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[237]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[238]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[239]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[23]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[240]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[241]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[242]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[243]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[244]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[245]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[246]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[247]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[248]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[249]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[24]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[250]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[251]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[252]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[253]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[254]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[255]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[25]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[26]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[27]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[28]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[29]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[30]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[31]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[32]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[33]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[34]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[35]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[36]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[37]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[38]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[39]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[40]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[41]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[42]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[43]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[44]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[45]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[46]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[47]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[48]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[49]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[50]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[51]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[52]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[53]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[54]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[55]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[56]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[57]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[58]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[59]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[5]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[60]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[61]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[62]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[63]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[64]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[65]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[66]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[67]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[68]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[69]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[6]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[70]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[71]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[72]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[73]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[74]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[75]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[76]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[77]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[78]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[79]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[7]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[80]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[81]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[82]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[83]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[84]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[85]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[86]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[87]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[88]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[89]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[8]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[90]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[91]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[92]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[93]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[94]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[95]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[96]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[97]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[98]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[99]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {all_counts[9]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[0]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[10]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[11]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[12]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[13]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[14]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[15]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[16]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[17]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[18]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[19]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[1]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[20]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[21]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[22]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[23]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[24]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[25]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[26]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[27]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[28]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[29]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[2]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[30]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[31]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[3]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[4]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[5]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[6]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[7]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[8]}]
set_output_delay 0.2000 -clock [get_clocks {core_clock}] -add_delay [get_ports {count_value[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
