###############################################################################
# Created by write_sdc
###############################################################################
current_design ariane
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 4.0000 [get_ports {clk_i}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
