###############################################################################
# Created by write_sdc
###############################################################################
current_design configurable_comparator
###############################################################################
# Timing Constraints
###############################################################################
set_input_delay 0.2000 -add_delay [get_ports {a[0]}]
set_input_delay 0.2000 -add_delay [get_ports {a[10]}]
set_input_delay 0.2000 -add_delay [get_ports {a[11]}]
set_input_delay 0.2000 -add_delay [get_ports {a[12]}]
set_input_delay 0.2000 -add_delay [get_ports {a[13]}]
set_input_delay 0.2000 -add_delay [get_ports {a[14]}]
set_input_delay 0.2000 -add_delay [get_ports {a[15]}]
set_input_delay 0.2000 -add_delay [get_ports {a[1]}]
set_input_delay 0.2000 -add_delay [get_ports {a[2]}]
set_input_delay 0.2000 -add_delay [get_ports {a[3]}]
set_input_delay 0.2000 -add_delay [get_ports {a[4]}]
set_input_delay 0.2000 -add_delay [get_ports {a[5]}]
set_input_delay 0.2000 -add_delay [get_ports {a[6]}]
set_input_delay 0.2000 -add_delay [get_ports {a[7]}]
set_input_delay 0.2000 -add_delay [get_ports {a[8]}]
set_input_delay 0.2000 -add_delay [get_ports {a[9]}]
set_input_delay 0.2000 -add_delay [get_ports {b[0]}]
set_input_delay 0.2000 -add_delay [get_ports {b[10]}]
set_input_delay 0.2000 -add_delay [get_ports {b[11]}]
set_input_delay 0.2000 -add_delay [get_ports {b[12]}]
set_input_delay 0.2000 -add_delay [get_ports {b[13]}]
set_input_delay 0.2000 -add_delay [get_ports {b[14]}]
set_input_delay 0.2000 -add_delay [get_ports {b[15]}]
set_input_delay 0.2000 -add_delay [get_ports {b[1]}]
set_input_delay 0.2000 -add_delay [get_ports {b[2]}]
set_input_delay 0.2000 -add_delay [get_ports {b[3]}]
set_input_delay 0.2000 -add_delay [get_ports {b[4]}]
set_input_delay 0.2000 -add_delay [get_ports {b[5]}]
set_input_delay 0.2000 -add_delay [get_ports {b[6]}]
set_input_delay 0.2000 -add_delay [get_ports {b[7]}]
set_input_delay 0.2000 -add_delay [get_ports {b[8]}]
set_input_delay 0.2000 -add_delay [get_ports {b[9]}]
set_input_delay 0.2000 -add_delay [get_ports {op_sel[0]}]
set_input_delay 0.2000 -add_delay [get_ports {op_sel[1]}]
set_input_delay 0.2000 -add_delay [get_ports {op_sel[2]}]
set_input_delay 0.2000 -add_delay [get_ports {signed_mode}]
set_output_delay 0.2000 -add_delay [get_ports {result}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
