###############################################################################
# Created by write_sdc
###############################################################################
current_design RocketTile
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1.2000 [get_ports {clock}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
